Config/Catalogs/ЗначенияРеквизитовСведенийОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗначенияРеквизитовСведенийОбИмуществе</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ЗначенияРеквизитовСведенийОбИмуществе/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Родитель = Справочники.ЗначенияРеквизитовСведенийОбИмуществе.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа Тогда
		Длина = Метаданные.Справочники.ЗначенияРеквизитовСведенийОбИмуществе.ДлинаНаименования;
		Наименование = ?(СтрДлина(НаименованиеПолное) > Длина, Сред(НаименованиеПолное, 1, Длина - 3) + "...", НаименованиеПолное);
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ПроверкаУникальностиЗначения() Тогда
		ТекстСообщения = НСтр("ru = 'Значение поля ""Код"" не уникально'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры


Функция ПроверкаУникальностиЗначения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияРеквизитовСведенийОбИмуществе.Ссылка
	               |ИЗ
	               |	Справочник.ЗначенияРеквизитовСведенийОбИмуществе КАК ЗначенияРеквизитовСведенийОбИмуществе
	               |ГДЕ
	               |	ЗначенияРеквизитовСведенийОбИмуществе.Родитель = &Родитель
	               |	И ЗначенияРеквизитовСведенийОбИмуществе.Код = &Код
	               |	И ЗначенияРеквизитовСведенийОбИмуществе.Ссылка <> &Ссылка
	               |	И НЕ ЗначенияРеквизитовСведенийОбИмуществе.ПометкаУдаления";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Не Выборка.Следующий();
		
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Если НЕ ЭтоГруппа И НеИспользуется Тогда
		
		НепроверяемыеРеквизиты = Новый Массив;

		НепроверяемыеРеквизиты.Добавить("НаименованиеПолное");
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
		
	КонецЕсли;	

КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
